//常數為const，變數為let，用來替換會一直重複使用的


//練習let


//command是兩個斜線，程式碼不會讀取


//我的背包內容物
//矩陣，稱作array，長的是左右中括弧，裡面就是放一堆集合的東西


//我的背包內容數量
//array的長度為length，.為執行甚麼function


//拿出我的書包的特定物品
//讀取方式為後面中括弧+第幾個(第一個為0，第二個為1...)


//全部輪流拿出來
//forEach，矩陣的函數，前面的()的第一個代表了變數
//第二個代表索引(可不加)，都可自己命名
//後面的{}代表執行的內容



//加上時間 new Date()


//放進新的 push


//拿走不要的 splice
//第一個參數為起始位置，第二個參數為結束位置


//限定書包大小後，計算還剩多少空間



//牛刀小試
//今天台北市長參選人為柯文哲，丁守中，姚文智
//1.請用程式碼加入一個新的參選人
//2.列出現在有幾位參選人
//3.每個候選人分別說出：「你好，我是ＸＸＸ，請投給我！」
//從let candidate = ["柯文哲","丁守中","姚文智"]開始

//在終端機中顯示===>
//現在參選人有4位，請他們發言：）
//你好，我是柯文哲，請投給我！
//你好，我是丁守中，請投給我！
//你好，我是姚文智，請投給我！
//你好，我是KAI，請投給我！



//Object，也稱物件，外圍是大括弧，用來詳述事物
//跟array不同是它會放key和value（也就是欄位和值）



//Object可以直接讀取某個欄位



//array裡也可以放Object（這就是JSON格式的組成！）
// let bag = ['蘋果','水梨','西瓜']



//複習：取array中的第一個，加上新觀念：抓取其中的address



//複習：forEach的用法，加上object用法



//計算剩餘多少空間數量



//用forEach來解決




//牛刀小試
//1.請寫出一個自創的JSON的格式
//2.讀取任意欄位，顯示出來

